{
  "_attn_implementation_autoset": true,
  "_name_or_path": "D:\\EXE\\RAG_AI_MenuGreen\\runtime\\models\\intent_onnx",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 384,
  "id2label": {
    "0": "recipe_search",
    "1": "nutrition_calc",
    "2": "inventory_check",
    "3": "meal_plan",
    "4": "web_browsing",
    "5": "calorie_lookup",
    "6": "general",
    "7": "unknown"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "label2id": {
    "calorie_lookup": 5,
    "general": 6,
    "inventory_check": 2,
    "meal_plan": 3,
    "nutrition_calc": 1,
    "recipe_search": 0,
    "unknown": 7,
    "web_browsing": 4
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tokenizer_class": "XLMRobertaTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 250037
}
